#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МобильныйКлиентАдаптацияФормы();
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ИнвентаризацияКассы(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ИнвентаризацияКассы.ФормаСписка", ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КассовыеДокументы(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("ЖурналДокументов.Деньги.Форма.КассовыеДокументы", ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Билеты(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Справочник.Билеты.ФормаСписка", ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанели(ЭтотОбъект,
		"КассовыеДокументы");
	
КонецПроцедуры

#КонецОбласти
