#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МобильныйКлиентАдаптацияФормы();
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ВыпускПродукции(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидОперации",
		ПредопределенноеЗначение("Перечисление.ВидыОперацийОтчетПроизводстваЗаСмену.ВыпускПродукции"));
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ОтчетПроизводстваЗаСмену.Форма.ФормаСписка", ЭтотОбъект, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура РасходМатериалов(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru='Расход материалов'"));
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ТребованиеНакладная.ФормаСписка", ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанели(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
