#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьПравоПросмотрМеток = ПравоДоступа("Просмотр", Метаданные.Справочники.НаборыДополнительныхРеквизитовИСведений);
	Элементы.Метки.Видимость = ЕстьПравоПросмотрМеток;

КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура СостоянияРаботыСЛидами(Команда)
	
	ОткрытьФормуВОкнеФормы("Справочник.СостоянияРаботыСЛидами.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура Метки(Команда)
	
	ВидСвойств = ПредопределенноеЗначение("Перечисление.ВидыСвойств.Метки");
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидСвойств", ВидСвойств);
	ОткрытьФормуВОкнеФормы("Справочник.НаборыДополнительныхРеквизитовИСведений.ФормаСписка", ПараметрыФормы, ВидСвойств);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуВОкнеФормы(ИмяФормы, ПараметрыФормы = Неопределено, Уникальность = Неопределено)
	
	Если Уникальность = Неопределено Тогда
		Уникальность = ИмяФормы;
	КонецЕсли;
	ОткрытьФорму(ИмяФормы, ПараметрыФормы, ЭтотОбъект, Уникальность, Окно);
	
КонецПроцедуры

#КонецОбласти