
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УчетнаяПолитика(Команда)
	
	ОткрытьФормуСОжиданием("РегистрСведений.УчетнаяПолитика.ФормаЗаписи", ПараметрыФормыУчетнаяПолитика());
	
КонецПроцедуры

&НаКлиенте
Процедура ПланСчетов(Команда)
	
	ОткрытьФормуСОжиданием("ПланСчетов.Хозрасчетный.ФормаСписка");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуСОжиданием(ИмяФормы, ПараметрыФормы = Неопределено)
	
	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием();
	ПараметрыОткрытия.ИмяФормы = ИмяФормы;

	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия, ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыФормыУчетнаяПолитика()
	
	Организация  = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	Ключ = НастройкиУчета.КлючЗаписиДействующейУчетнойПолитики("УчетнаяПолитика", Организация);
	
	ПараметрыФормы = Новый Структура;
	Если Ключ <> Неопределено Тогда
		ПараметрыФормы.Вставить("Ключ", Ключ);
	Иначе
		ЗначенияЗаполнения = Новый Структура("Организация ", Организация );
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	КонецЕсли;
	ПараметрыФормы.Вставить("РежимНастройки", Истина);
	
	Возврат ПараметрыФормы;
	
КонецФункции

#КонецОбласти