////////////////////////////////////////////////////////////////////////////////
// ЕдиныйНалоговыйСчетЛичныйКабинетПереопределяемый
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОсновнаяОрганизация(ТекущаяОрганизация) Экспорт
	
КонецПроцедуры

Процедура ГоловнаяОрганизация(ТекущаяОрганизация) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ГоловнаяОрганизация(ТекущаяОрганизация);
	
КонецПроцедуры

Процедура ДоступныеОрганизации(ТаблицаОрганизация) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ДоступныеОрганизации(ТаблицаОрганизация);
	
КонецПроцедуры

Процедура ОсновнаяРегистрацияВНалоговомОргане(Организация, ТекущаяРегистрация) Экспорт
	
КонецПроцедуры

Процедура ПриСозданииНаСервере(Форма) Экспорт
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		
		МобильныйКлиентБПФормаОбъекта.НастроитьФорму(Форма);
	
		Предупреждение = МобильныйКлиентБПФормаОбъекта.СоздатьПредупреждениеОбОграничениях(Форма,
			"Получить сведения из личного кабинета ЕНС можно в версии для компьютера");
		
		Элементы = Форма.Элементы;
		МобильныйКлиентБПФормаОбъекта.ВстроитьЭлементФормыВГруппаМКФормаВажное(Элементы, Предупреждение);
		МобильныйКлиентБПФормаОбъекта.СкрытьПрочиеЭлементыФормы(Форма);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьФормуНаСервере(Форма) Экспорт
	
КонецПроцедуры

Процедура УправлениеФормой(Форма) Экспорт
	
КонецПроцедуры

Процедура УстановитьУсловноеОформление(Форма) Экспорт
	
КонецПроцедуры

Процедура ПереключениеКомандПлатежиРасхождение(Форма) Экспорт
	
КонецПроцедуры

Процедура ПереключениеКомандОтчетыРасхождение(Форма) Экспорт
	
КонецПроцедуры

Процедура ПереключениеКомандНачисленияРасхождение(Форма) Экспорт
	
КонецПроцедуры

Процедура ПереключениеКомандУплатаРасхождение(Форма) Экспорт
	
КонецПроцедуры

Процедура ПереключениеКомандПениШтрафыРасхождение(Форма) Экспорт
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверки(Признак) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ПоддерживаетсяРежимСверки(Признак);
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиГлавное(Признак) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ПоддерживаетсяРежимСверкиГлавное(Признак);
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиСальдоЕНС(Признак) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ПоддерживаетсяРежимСверкиСальдоЕНС(Признак);
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиСальдоЕНП(Признак) Экспорт

КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиПлатежи(Признак) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ПоддерживаетсяРежимСверкиПлатежи(Признак);
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиОтчеты(Признак) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ПоддерживаетсяРежимСверкиОтчеты(Признак);
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиНачисления(Признак) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ПоддерживаетсяРежимСверкиНачисления(Признак);
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиУплаты(Признак) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ПоддерживаетсяРежимСверкиУплаты(Признак);
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиПениШтрафы(Признак) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ПоддерживаетсяРежимСверкиПениШтрафы(Признак);
	
КонецПроцедуры

Процедура ПоддерживаетсяАвтоматическаяРегистрацияУплат(Признак) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ПоддерживаетсяАвтоматическаяРегистрацияУплат(Признак);
	
КонецПроцедуры

Процедура ПериодОбработкиДанныхДляРегистрацииУплат(Организация, НачалоПериода, КонецПериода) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ПериодОбработкиДанныхДляРегистрацииУплат(Организация, НачалоПериода, КонецПериода);
	
КонецПроцедуры

Процедура ДоступноОтражениеВУчетеНачислений(Признак) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ДоступноОтражениеВУчетеНачисленийПениШтрафов(Признак);
	
КонецПроцедуры

Процедура ДоступноОтражениеВУчетеУплаты(Признак) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ДоступноОтражениеВУчетеУплаты(Признак);
	
КонецПроцедуры

Процедура ДоступноОтражениеВУчетеПениШтрафов(Признак) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ДоступноОтражениеВУчетеНачисленийПениШтрафов(Признак);
	
КонецПроцедуры

Процедура ОтражениеВУчетеДоступноСтрокаНачисления(ДанныеСтроки, Признак) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ОтражениеВУчетеДоступноСтрокаНачисления(ДанныеСтроки, Признак);
	
КонецПроцедуры

Процедура ОтражениеВУчетеДоступноСтрокаУплаты(ДанныеСтроки, Признак) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ОтражениеВУчетеДоступноСтрокаУплаты(ДанныеСтроки, Признак);
	
КонецПроцедуры

Процедура ОтражениеВУчетеДоступноСтрокаПениШтрафы(ДанныеСтроки, Признак) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ОтражениеВУчетеДоступноСтрокаПениШтрафы(ДанныеСтроки, Признак);
	
КонецПроцедуры

Процедура ПереключениеКомандОперацииЕНПРасхождение(Форма) Экспорт
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиОперацииЕНП(Признак) Экспорт

КонецПроцедуры

#КонецОбласти
