
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если МобильныйКлиентБПКлиент.ЭтоМобильныйКлиент() Тогда
		ОткрытьФорму("Справочник.ОсновныеСредства.Форма.ФормаСпискаПростойИнтерфейсМК");
		Возврат;
	КонецЕсли;

	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием(ПараметрыВыполненияКоманды);
	ПараметрыОткрытия.ИмяФормы = "Справочник.ОсновныеСредства.Форма.ФормаСпискаПростойИнтерфейс";
	ПараметрыОткрытия.ЗамерПроизводительности = "ПростойИнтерфейсОсновныеСредства";

	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия);

КонецПроцедуры
