////////////////////////////////////////////////////////////////////////////////
// ЕдиныйНалоговыйСчетИнтеграцияВнутреннийБП
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПоказатьПодсказкуИнтеграцияСЛичнымКабинетомЕНС(Форма, Организация, Период) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ПоказатьПодсказкуИнтеграцияСЛичнымКабинетомЕНС(Форма, Организация, Период)

КонецПроцедуры

Процедура ЗарегистрироватьУплатуНалоговИВзносов(Параметры) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ЗарегистрироватьУплатуНалоговИВзносов(Параметры);
	
КонецПроцедуры

#КонецОбласти
