#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МобильныйКлиентАдаптацияФормы();
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ПлатежныеПоручения(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ПлатежноеПоручение.ФормаСписка", ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура БанковскиеВыписки(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("ЖурналДокументов.Деньги.Форма.БанковскиеВыписки", ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОперацииПоПлатежнымКартам(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ОплатаПлатежнойКартой.ФормаСписка", ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПлатежиПоРеестрам(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ОплатаПлатежнойКартой.Форма.ФормаПлатежиПоРеестрам", ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанели(ЭтотОбъект,
		"ПлатежныеПоручения,СогласованиеПлатежей,БанковскиеВыписки,ОперацииПоПлатежнымКартам");
	
КонецПроцедуры

#КонецОбласти
