#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МобильныйКлиентАдаптацияФормы();
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ЛьготныеКредиты(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ЗаявкиНаЛьготныйКредит.ФормаСписка", ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Сервис1СОткрытиеСчета(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Заявки 1С:Открытие счета'"));
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("РегистрСведений.СостояниеЗаявокНаОткрытиеСчета.ФормаСписка", ЭтотОбъект, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Сервис1СКредит(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("СервисОбменаСБанками",
		ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ЗаявкиНаКредит"));
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Заявки 1С:Кредит'"));
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("РегистрСведений.СостояниеЗаявокНаКредит.ФормаСписка", ЭтотОбъект, ПараметрыФормы, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Сервис1СЛизинг(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("СервисОбменаСБанками",
		ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ЗаявкиНаЛизинг"));
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Заявки 1С:Лизинг'"));
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("РегистрСведений.СостояниеЗаявокНаКредит.ФормаСписка", ЭтотОбъект, ПараметрыФормы, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Сервис1СФинОтчетность(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Заголовок",  НСтр("ru = '1С:ФинОтчетность'"));
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("РегистрСведений.ЖурналСтатусовФинОтчетностиВБанки.ФормаСписка", ЭтотОбъект, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ФинансыОрганизации(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Обработка.ФинансыОрганизации.Форма", ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаДепозит(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ЗаявкаНаДепозитОбменСБанками.Форма.ФормаСписка", ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанели(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

