
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Обработки.ПанелиПростойИнтерфейс.ЗадатьВидимостьЭлементовФормы(ЭтотОбъект);
	
	МобильныйКлиентАдаптацияФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УчетнаяПолитика(Команда)
	
	Отбор = Новый Структура("Организация", ОбщегоНазначенияБПВызовСервера.ОсновнаяОрганизация());
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("РегистрСведений.УчетнаяПолитика.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УставныйКапитал(Команда)
	
	Отбор = Новый Структура("Организация", ОбщегоНазначенияБПВызовСервера.ОсновнаяОрганизация());
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("Документ.ФормированиеУставногоКапитала.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подразделения(Команда)
	
	Отбор = Новый Структура("Владелец", ОбщегоНазначенияБПВызовСервера.ОсновнаяОрганизация());
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("Справочник.ПодразделенияОрганизаций.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацииВНалоговыхОрганах(Команда)
	
	Отбор = Новый Структура("Владелец", ОбщегоНазначенияБПВызовСервера.ОсновнаяОрганизация());
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("Справочник.РегистрацииВНалоговомОргане.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Валюты(Команда)
	
	ОткрытьФорму("Справочник.Валюты.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыОплат(Команда)
	
	ОткрытьФорму("Справочник.ВидыОплатОрганизаций.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура БанковскиеСчета(Команда)
	
	Отбор = Новый Структура("Владелец", ОбщегоНазначенияБПВызовСервера.ОсновнаяОрганизация());
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("Справочник.БанковскиеСчета.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛимитОстаткаКассы(Команда)
	
	Отбор = Новый Структура("Организация", ОбщегоНазначенияБПВызовСервера.ОсновнаяОрганизация());
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("РегистрСведений.ЛимитОстаткаКассыОрганизаций.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Склады(Команда)
	
	ОткрытьФорму("Справочник.Склады.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыЦенНоменклатуры(Команда)
	
	ОткрытьФорму("Справочник.ТипыЦенНоменклатуры.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыНоменклатуры(Команда)
	
	ОткрытьФорму("Справочник.ВидыНоменклатуры.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиЗарплаты(Команда)
	
	ОткрытьФорму("ОбщаяФорма.НастройкиЗарплаты", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ФизическиеЛица(Команда)
	
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатныеПроекты(Команда)
	
	ОткрытьФорму("Справочник.ЗарплатныеПроекты.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланСчетов(Команда)
	
	ОткрытьФорму("ПланСчетов.Хозрасчетный.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатурныеГруппы(Команда)
	
	ОткрытьФорму("Справочник.НоменклатурныеГруппы.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьиЗатрат(Команда)
	
	ОткрытьФорму("Справочник.СтатьиЗатрат.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочиеДоходыИРасходы(Команда)
	
	ОткрытьФорму("Справочник.ПрочиеДоходыИРасходы.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБудущихПериодов(Команда)
	
	ОткрытьФорму("Справочник.ДоходыБудущихПериодов.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыБудущихПериодов(Команда)
	
	ОткрытьФорму("Справочник.РасходыБудущихПериодов.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаОрганизация,
		"УчетнаяПолитика,УставныйКапитал,Подразделения,РегистрацииВНалоговыхОрганах");
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаДеньги,
		"Валюты,ВидыОплат,БанковскиеСчета,ЛимитОстаткаКассы");
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаТовары,
		"Склады,ВидыНоменклатуры");
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаСотрудники);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаБухгалтерия,
		"ПланСчетов,НастройкаПланаСчетов,НоменклатурныеГруппы,СтатьиЗатрат,ПрочиеДоходыИРасходы,
		|ДоходыБудущихПериодов,РасходыБудущихПериодов");
	
КонецПроцедуры

#КонецОбласти
