#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТарификацияБП.КонстантаФункциональностиПередЗаписью(Метаданные().Имя, Значение, Отказ);
	
	Если НЕ Отказ 
		И ЭтотОбъект.Значение 
		И НЕ Константы.ВедетсяОтгрузкаБезПереходаПраваСобственности.Получить() Тогда
		Константы.ВедетсяОтгрузкаБезПереходаПраваСобственности.Установить(Истина);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли