
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.УстановкаЦенНоменклатуры.Видимость = ПравоДоступа("Просмотр", Метаданные.Документы.УстановкаЦенНоменклатуры);
	
	МобильныйКлиентАдаптацияФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Склады(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Справочник.Склады.ФормаСписка", ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыЦенНоменклатуры(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Справочник.ТипыЦенНоменклатуры.ФормаСписка", ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаЦенНоменклатуры(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.УстановкаЦенНоменклатуры.ФормаСписка", ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыНоменклатуры(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Справочник.ВидыНоменклатуры.ФормаСписка", ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанели(ЭтотОбъект,
		"Склады,ВидыНоменклатуры");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаЗаполненияЦен(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Обработка.ПанельАдминистрированияБП.Форма.ФормаНастройкиЦеныПродажи", ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
