#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МобильныйКлиентАдаптацияФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВидыОплат(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Справочник.ВидыОплатОрганизаций.ФормаСписка", ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Валюты(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Справочник.Валюты.ФормаСписка", ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура БанковскиеСчета(Команда)
	
	Отбор = Новый Структура("Владелец", ОбщегоНазначенияБПВызовСервера.ОсновнаяОрганизация());
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Справочник.БанковскиеСчета.ФормаСписка", ЭтотОбъект, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛимитОстаткаКассы(Команда)
	
	Отбор = Новый Структура("Организация", ОбщегоНазначенияБПВызовСервера.ОсновнаяОрганизация());
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("РегистрСведений.ЛимитОстаткаКассыОрганизаций.ФормаСписка", ЭтотОбъект, ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанели(ЭтотОбъект,
		"Валюты,ВидыОплат,БанковскиеСчета,ЛимитОстаткаКассы");
	
КонецПроцедуры

#КонецОбласти